In [1]:
# Write a python code to create a .csv file
import pandas as pd

In [2]:
data = {
    'emp_id' : [101,102,103,104],
    'emp_name' : ['Aman','Deepak','Deva','Gopi'],
    'departement':['Developement','Management','Testing','HR'],
    'salary':[1500000,1200000,230000,980000]
}

df = pd.DataFrame(data)
# df or print(df)
df

   emp_id emp_name   departement   salary
0     101     Aman  Developement  1500000
1     102   Deepak    Management  1200000
2     103     Deva       Testing   230000
3     104     Gopi            HR   980000

In [3]:
df.to_csv('employee.csv',index=False)
print('Data is saved successfully')

Data is saved successfully

In [4]:
# How to read csv file ?
# Read .csv file

newDf = pd.read_csv('student_info.csv')
newDf

     study_hours  student_marks
0           6.83          78.50
1           6.56          76.74
2            NaN          78.68
3           5.67          71.82
4           8.67          84.19
..           ...            ...
195         7.53          81.67
196         8.56          84.68
197         8.94          86.75
198         6.60          78.05
199         8.35          83.50

[200 rows x 2 columns]

In [5]:
print(pd)

<module 'pandas' from '/usr/local/lib/python3.6/dist-packages/pandas/__init__.py'>

In [6]:
print(df.dtypes)

emp_id          int64
emp_name       object
departement    object
salary          int64
dtype: object

In [7]:
print(df.index)

RangeIndex(start=0, stop=4, step=1)

In [8]:
print(df.values)

[[101 'Aman' 'Developement' 1500000]
 [102 'Deepak' 'Management' 1200000]
 [103 'Deva' 'Testing' 230000]
 [104 'Gopi' 'HR' 980000]]

In [9]:
# Shape property of DataFrame is use to display shape

newDf.shape

(200, 2)

In [10]:
# head() :- head() of DataFrame display top 5 rows

newDf.head()

   study_hours  student_marks
0         6.83          78.50
1         6.56          76.74
2          NaN          78.68
3         5.67          71.82
4         8.67          84.19

In [11]:
# tail() :- tail() function of DataFrame display last five rows 
newDf.tail()

     study_hours  student_marks
195         7.53          81.67
196         8.56          84.68
197         8.94          86.75
198         6.60          78.05
199         8.35          83.50

In [12]:
# series :- series is a data structure in pandas . It work like one dimensional array
import numpy as np

In [13]:
series = pd.Series(np.random.rand(500))
series

0      0.603683
1      0.625467
2      0.727316
3      0.627062
4      0.973150
         ...
495    0.535946
496    0.684247
497    0.868471
498    0.207058
499    0.051774
Length: 500, dtype: float64

In [14]:
type(series)

pandas.core.series.Series

In [15]:
dataframe = pd.DataFrame(np.random.rand(100,5))
dataframe

           0         1         2         3         4
0   0.925348  0.567972  0.637521  0.134193  0.826838
1   0.967574  0.096106  0.938871  0.203735  0.623373
2   0.768977  0.813978  0.824118  0.775861  0.698736
3   0.261180  0.797873  0.016650  0.219911  0.056510
4   0.445916  0.806538  0.482449  0.725927  0.276242
..       ...       ...       ...       ...       ...
95  0.127568  0.149235  0.831589  0.148342  0.868886
96  0.278611  0.242200  0.510483  0.122308  0.559112
97  0.464758  0.197848  0.422594  0.477716  0.169223
98  0.365816  0.572909  0.446062  0.009794  0.014807
99  0.868978  0.263032  0.400917  0.576373  0.622996

[100 rows x 5 columns]

In [21]:
dataframe = pd.DataFrame({
    'number': (np.random.rand(5))*100,
    'marks':(np.random.rand(5))*100
})
dataframe

      number     marks
0   9.821326  0.389021
1  68.739469  0.464960
2  90.312545  0.363367
3  52.709748  0.809058
4  91.061934  0.776812

In [17]:
dataframe.dtypes

number    float64
marks     float64
dtype: object

In [18]:
dataframe.head()

     number     marks
0  0.988217  0.548999
1  0.477622  0.835326
2  0.368284  0.666040
3  0.973658  0.330459
4  0.067985  0.109180

In [19]:
newDf.describe()

       study_hours  student_marks
count   195.000000      200.00000
mean      6.995949       77.93375
std       1.253060        4.92570
min       5.010000       68.57000
25%       5.775000       73.38500
50%       7.120000       77.71000
75%       8.085000       82.32000
max       8.990000       86.99000

In [20]:
# How to read xlsx file

excelData = pd.read_excel('students.xlsx', engine='openpyxl')
excelData

   Roll_No    Name    Fee
0     1001   Rohit  50000
1     1002   Mohit  40000
2     1003  Sobhit  55000
3     1004   Mudit  56000